{
  "title": "Astragaloside IV alleviates neuronal ferroptosis in ischemic stroke by regulating fat mass and obesity-associated-N6-methyladenosine-acyl-CoA synthetase long-chain family member 4 axis",
  "abstract": "Ischemic stroke (IS) is a detrimental neurological disease with limited treatment options. Astragaloside IV (As-IV) was a promising bioactive constituent in the treatment of IS. However, the functional mechanism remains unclear. Here, IS cell and mouse models were established by oxygen glucose deprivation/re-oxygenation (OGD/R) and middle cerebral artery occlusion (MCAO). Quantitative reverse transcription PCR (RT-qPCR), Western blotting, or Immunofluorescence staining measured related gene and protein expression of cells or mice brain tissues, and the results revealed altered expression of acyl-CoA synthetase long-chain family member 4 (Acsl4), fat mass and obesity-associated (Fto), and activation transcription factor 3 (Atf3) after treatment with As-IV. Then, increased N6 -methyladenosine (m6 A) levels caused OGD/R or MCAO were reduced by As-IV according to the data from methylated RNA immunoprecipitation (MeRIP)-qPCR and dot blot assays. Moreover, through a series of functional experiments such as observing mitochondrial changes under transmission electron microscopy (TEM), evaluating cell viability by cell counting kit-8 (CCK-8), analyzing infract area of brain tissues by 2,3,5-triphenyltetrazolium chloride (TTC) staining, measuring levels of malondialdehyde (MDA), lactate dehydrogenase (LDH), Fe2+ , solute carrier family 7 member 11 (Slc7a11) and glutathione peroxidase 4 (Gpx4) and concentration of glutathione (GSH), we found that Fto knockdown, Acsl4 overexpression or Atf3 knockdown promoted the viability of OGD/R cells, inhibited cell ferroptosis, reduced infract size, while As-IV treatment or Fto overexpression reversed these changes. In mechanism, the interplays of YTH N6 -methyladenosine RNA-binding protein 3 (Ythdf3)/Acsl4 and Atf3/Fto were analyzed by RNA-pull down, RNA immunoprecipitation (RIP), chromatin immunoprecipitation (ChIP) and dual-luciferase reporter assay. Fto regulated the m6 A levels of Acsl4. Ythdf3 bound to Acsl4, and modulated its levels through m6 A modification. Atf3 bound to Fto and positively regulated its levels. Overall, As-IV promoted the transcription of Fto by upregulating Atf3, resulting in decreased m6 A levels of Acsl4, thus, improving neuronal injury in IS by inhibiting ferroptosis.",
  "extraction_time": "March 25, 2025 05:32 PM UTC"
}