{
  "title": "METTL14 is decreased and regulates m6 A modification of α-synuclein in Parkinson's disease",
  "abstract": "N6-methyladenosine (m6A), an emerging modification of messenger RNA, has been implicated in many biological processes. However, its role in Parkinson's disease (PD) remains largely unknown. Here, we investigated the role of m6A modification and its underlying mechanism in PD. First, 86 individuals with PD and 86 healthy controls were recruited from a pilot multicenter cohort. Levels of m6A and its modulators in peripheral blood mononuclear cells of patients with PD and controls were measured using an m6A RNA methylation quantification kit and quantitative real-time PCR. The underlying mechanism of m6A modification in PD was investigated in vitro through RNA immunoprecipitation assay, RNA stability assay, gene silencing or overexpression, western blot, and confocal immunoassay. The results show that mRNA levels of m6A, METTL3, METTL14, and YTHDF2 in patients with PD were significantly lower than in healthy controls, and METTL14 was the main factor involved in abnormal m6A modification. Area under the curve (AUC) analysis suggests METTL14 may provide excellent diagnostic capability for PD, especially when combined with plasma α-synuclein (α-syn). Spearman correlation analysis identified that METTL14 was moderately negatively correlated with plasma α-syn and the motor function of PD. Mechanistic experiments demonstrated that Mettl14 targets and regulates the expression of the α-syn gene using its methylation function. Overexpression of Mettl14 dramatically increased m6 A modification of α-syn mRNA and weakened its stability. Further results suggest that α-syn mRNA was modified by Mettl14 binding of an m6 A motif in the coding region of α-syn mRNA, while the reading protein Ythdf2 was involved in recognizing m6 A-modified α-syn mRNA. Taken together, our results reveal the potential of METTL14 as a novel diagnostic biomarker for PD and identify modification of pathogenic α-syn protein by METTL14 via an m6 A-YTHDF2-dependent mechanism.",
  "extraction_time": "March 25, 2025 05:41 PM UTC"
}